Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ZeroLengthViewRegionsRemoved
Some View Regions were removed. When the size of a View Region becomes zero, it is removed from the view.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ZeroLengthViewBreaksRemoved
Some View Regions were consolidated. When the size of a View Break between View Regions becomes zero, the View Break
is removed and the adjacent View Regions are joined.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ViewPublishFailed
The following views could not be published.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.TurnCropRegionOffRemovesViewBreaks
Turning off the Crop Region of the view will remove all View Breaks. If the Crop Region is turned on at a later time,
any desired View Breaks must be created again.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ReloadLatestDeletedLastOpenView
The only open view has been deleted because of changes from the Central Model.  Open another view and Reload Latest or Synchronize with Central again.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NothingToApplyWarning
Start and end elevations are the same, nothing to Apply.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NothingToApplyError
Start and end elevations are the same, nothing to Apply.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.NoTargetsForDependentViewPropagation
There are no valid views. Only views without dependents can be used.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InvalidDBviewScopeBox
The scope box and view must have parallel vertical axes.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertComponentViewFailure
This type of Component cannot be placed in Elevation or Section view

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertComponentViewError
This type of Component cannot be placed in Elevation or Section view

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertColumnViewFailure
Column cannot be placed in Elevation or Section view

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertColumnViewError
Column cannot be placed in Elevation or Section view

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InitialViewDeleted
The starting view for the project has been deleted.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.DetailNumberEmpty
Detail Number is empty

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.DetailNumberDuplicate
Detail Number is already in use. Enter a unique number.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CannotToggleToPerspective
Cannot toggle to perspective view because the view contains annotations.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CannotPasteViewReferences
Cannot paste view references into the view they reference or into unrelated views

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CanNotDeleteLastOpenView
Deleting of all open views in a project is not allowed.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures.BadViewDirectionSetting
Plan view DBViewType has invalid view direction parameter.

Autodesk.Revit.DB.BuiltInFailures.ViewFailures
Failures about ViewFailures.